[{"model": "news.post", "pk": 1, "fields": {"title": "Dark Souls", "text": "Dark Souls[a] is a series of action role-playing games developed by FromSoftware and created by Hidetaka Miyazaki. The series began with the release of Dark Souls in 2011 and has seen two sequels, Dark Souls II (2014) and Dark Souls III (2016). The series has been both praised and criticized for its high level of difficulty.\r\n\r\nOther FromSoftware games, including Demon's Souls, King's Field, Bloodborne, Sekiro, and Elden Ring, share several related concepts and are commonly grouped together as Soulslikes. Dark Souls has received critical acclaim, with the first game often cited as one of the greatest in video games. By 2021, the series had shipped nearly 30 million copies.", "rating": 15, "dateCreation": "2022-08-01T19:32:49.212", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 2, "fields": {"title": "Doom Eternal", "text": "Doom Eternal is a first-person shooter game developed by id Software and published by Bethesda Softworks. The sequel to Doom (2016), and the fifth main game in the Doom series, it was released on March 20, 2020, for Windows, PlayStation 4, Stadia and Xbox One, with a version for Nintendo Switch being released on December 8, 2020, and versions for PlayStation 5 and Xbox Series X and Series S being released on June 29, 2021. Set some time after the events of the 2016 game, the story follows the Doomslayer once again, on a mission to end Hell's consumption of Earth and foil the alien Maykr's plans to exterminate humanity.\r\n\r\nAlong with the single-player campaign, a multiplayer mode, Battlemode, was introduced. In this mode, players can either play as the Doom Slayer or as a demon, and fight until either the Doom Slayer defeats the demons, or vice versa. Another mode, Horde mode, was added in October 2021. The Ancient Gods, a two-part standalone campaign DLC set after the events of the main game, was released between October 2020 and March 2021.\r\n\r\nDoom Eternal was released to a positive critical response, with praise for its campaign, graphics, level design, soundtrack, and combat mechanics, though some disliked the increased focus on storytelling and its platforming sections. Doom Eternal received five nominations at The Game Awards for 2020, including Game of the Year and Best Action Game.", "rating": 9, "dateCreation": "2022-08-07T19:33:41.706", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 3, "fields": {"title": "Hollow Knight", "text": "Hollow Knight is a 2017 Metroidvania action-adventure game developed and published by independent developer Team Cherry. In the game, the player controls the Knight, a nameless insectoid warrior. The Knight explores Hallownest, a fallen kingdom plagued by a supernatural disease. The game is set in diverse subterranean locations, and it features friendly and hostile bug-like characters and numerous bosses. Players have the opportunity to unlock new abilities as they explore each location, along with pieces of lore and flavor text that are spread throughout the kingdom.\r\n\r\nThe concept behind Hollow Knight was originally conceived in 2013 in the Ludum Dare game jam. Team Cherry wanted to create a game inspired by older platformers that replicated the explorational aspects of its influences. Inspirations for the game include Faxanadu, Metroid, Zelda II: The Adventure of Link, and Mega Man X. Development was partially funded through a Kickstarter crowdfunding campaign that raised over A$57,000 by the end of 2014. It was released for Microsoft Windows, macOS, and Linux in early 2017 and for the Nintendo Switch, PlayStation 4, and Xbox One in 2018. After release, Team Cherry supported the game with four expansions.\r\n\r\nHollow Knight received widespread acclaim from critics, who highlighted the game's worldbuilding, music, character design, and combat mechanics, with emphasis on the extensive story. By December 2020, the game had sold 3 million copies. A sequel, Hollow Knight: Silksong, is currently in development.", "rating": 15, "dateCreation": "2022-08-11T19:34:16.902", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 4, "fields": {"title": "The Witcher 3", "text": "The Witcher 3: Wild Hunt[a] is a 2015 action role-playing game developed and published by CD Projekt. It is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third game in The Witcher video game series, played in an open world with a third-person perspective. The games are based on The Witcher series of fantasy novels written by Andrzej Sapkowski.\r\n\r\nThe game takes place in a fictional fantasy world based on Slavic mythology. Players control Geralt of Rivia, a monster slayer for hire known as a Witcher, and search for his adopted daughter, who is on the run from the otherworldly Wild Hunt. Players battle the game's many dangers with weapons and magic, interact with non-player characters, and complete quests to acquire experience points and gold, which are used to increase Geralt's abilities and purchase equipment. The game's story has three possible endings, determined by the player's choices at key points in the narrative.\r\n\r\nDevelopment began in 2011 and lasted for three and a half years. Central and Northern European cultures formed the basis of the game's world. The game was developed using the REDengine 3, which enabled CD Projekt to create a complex story without compromising its open world. The music was primarily composed by Marcin Przybyłowicz and performed by the Brandenburg State Orchestra.\r\n\r\nThe Witcher 3: Wild Hunt was released for Windows, PlayStation 4, and Xbox One in May 2015, with a Nintendo Switch version released in October 2019, and PlayStation 5 and Xbox Series X/S versions planned for release in Q4 2022. The game received critical acclaim, with praise for its gameplay, narrative, world design, combat, and visuals, although it received minor criticism due to technical issues. It received numerous game of the year awards and has been cited as one of the best video games ever made. Two expansions were also released to critical acclaim: Hearts of Stone and Blood and Wine. A Game of the Year edition was released in August 2016, with the base game, expansions and all downloadable content. The game shipped over 40 million copies, making it one of the best selling video games of all time.", "rating": 13, "dateCreation": "2022-08-15T19:34:56.158", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 5, "fields": {"title": "Elden Ring", "text": "Elden Ring[a] is a 2022 action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment. It was directed by Hidetaka Miyazaki with worldbuilding provided by the fantasy writer George R. R. Martin. It was released for PlayStation 4, PlayStation 5, Windows, Xbox One, and Xbox Series X/S on February 25.\r\n\r\nIn Elden Ring, players control a customizable player character on a journey to repair the Elden Ring and become the new Elden Lord. The game is presented through a third-person perspective, with players freely roaming its interactive open world. Gameplay elements include combat using several types of weapons and magic spells, horseback riding, and crafting.\r\n\r\nFromSoftware wanted to create an open-world game with gameplay similar to their existing Dark Souls series, intending Elden Ring to act as an evolution of Dark Souls. Miyazaki admired Martin's work and hoped his contributions would produce a more accessible narrative than FromSoftware's previous games. Elden Ring received critical acclaim for its gameplay systems, exploration, and setting, with some criticism of its technical performance and its difficulty. By July 2022, the game had sold more than 16.6 million copies.", "rating": 20, "dateCreation": "2022-08-22T19:35:32.062", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 6, "fields": {"title": "After 7 months, Dark Souls 3 is back online", "text": "After a quiet seven months for Dark Souls 3 PvPers, the PC servers have finally whirred back to life today, reviving the game's online features which have lain dormant since the discovery of a serious security vulnerability (opens in new tab) in the game's code back in January.\r\n\r\nThat means Dark Souls 3 players can once again enjoy all the thrills of player invasions, summoning, and contorting the game's soapstone messaging system to write some of the filthiest things imaginable. In the tweet announcing DS3's online resurrection, FromSoft indicated that the same features for Dark Souls 1 and 2 would follow in short order. With any luck, it won't take over half a year this time.", "rating": 12, "dateCreation": "2022-08-24T19:37:24.959", "categoryType": "NW", "postAuthor": 3}}, {"model": "news.post", "pk": 7, "fields": {"title": "Sifu's summer update will let you kick ass without getting your ass kicked", "text": "If you've wanted to try your hand at Sifu (opens in new tab) but felt put off by its notorious difficulty, the big summer content update might be just what you've been waiting for. Set to go live next week, it will include swanky outfits, a new scoring system, and gameplay modifiers that will make Sifu even harder—or, if you prefer, a whole lot easier.\r\n\r\nHow much easier? Think Superman throwing hands with your high school bully and you'll have the right idea. Modifiers can be used to enable options including infinite health, weaker enemies, unbreakable weapons, full skill unlocks, and even bullet time, if you really want to lay a brutal beatdown on the bad guys. Conversely, you can turn the experience even more painful for yourself, rather than your foes: Make the enemies tougher, make weapons unusable, and give yourself just one health point if you really want to prove your stuff.\r\n\r\nSpeaking of which, there's a new scoring system that will track your punches, kicks, sweeps, and finishers, and deliver a ranking for each level based on \"smoothness, efficiency, and variety.\" There's no mention of online leaderboards, which seems like an odd thing to omit when adding a highly-detailed scoring system, but it's not clear whether leaderboards are absent or just not mentioned in the announcement. I've reached out to ask and will update if someone tells me.\r\n\r\nAs for the new outfits, there will be two added in the update: The Master Hand, a trench coat and stylish hat, will be available to all players, while the Enforcer tactical armor, available in the Wuguan, will be limited to owners of the Sifu deluxe edition.\r\n\r\nSifu's summer update is set to go live on August 31. Sifu itself is currently on sale for $30—25% off the regular price—until September 6 on the Epic Games Store (opens in new tab).", "rating": 9, "dateCreation": "2022-08-27T19:39:35.198", "categoryType": "NW", "postAuthor": 3}}, {"model": "news.post", "pk": 8, "fields": {"title": "Hikaru no Go", "text": "Hikaru no Go (ヒカルの碁, lit. Hikaru's Go) is a Japanese manga series based on the board game Go, written by Yumi Hotta and illustrated by Takeshi Obata. The production of the series' Go games was supervised by Go professional Yukari Umezawa. It was serialized in Shueisha's Weekly Shōnen Jump from 1999 to 2003, with its chapters collected into 23 tankōbon volumes.\r\n\r\nIt was adapted into an anime television series by Studio Pierrot, which ran for 75 episodes from 2001 to 2003 on TV Tokyo, with a New Year's Special aired in January 2004. Viz Media released both the manga and anime in North America; they serialized the manga in Shonen Jump, released its collected volumes in entirety, and the anime aired simultaneously on ImaginAsian.\r\n\r\nHikaru no Go was well-received, had over 25 million copies in circulation and won the Shogakukan Manga Award in 2000 and Tezuka Osamu Cultural Prize in 2003. It is largely responsible for popularizing Go among the youth of Japan since its debut, and considered by Go players everywhere to have sparked worldwide interest in the game, noticeably increasing the Go-playing population around the globe.", "rating": 17, "dateCreation": "2022-08-28T12:29:37.638", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 9, "fields": {"title": "Attack on Titan", "text": "Attack on Titan (Japanese: 進撃の巨人, Hepburn: Shingeki no Kyojin, lit. 'The Advancing Giants') is a Japanese manga series written and illustrated by Hajime Isayama. It is set in a world where humanity is forced to live in cities surrounded by three enormous walls that protect them from gigantic man-eating humanoids referred to as Titans; the story follows Eren Yeager, who vows to exterminate the Titans after they bring about the destruction of his hometown and the death of his mother. Attack on Titan was serialized in Kodansha's monthly shōnen manga magazine Bessatsu Shōnen Magazine from September 2009 to April 2021, with its chapters collected in 34 tankōbon volumes.\r\n\r\nAn anime television series was produced by Wit Studio (seasons 1–3) and MAPPA (season 4). A 25-episode first season was broadcast from April to September 2013, followed by a 12-episode second season broadcast from April to June 2017. A 22-episode third season was broadcast in two parts, with the first 12 episodes airing from July to October 2018 and the last 10 episodes airing from April to July 2019. A fourth and final season premiered in December 2020, airing 16 episodes in its first part. A second part consisting of 12 episodes aired from January to April 2022, and a third and final part will premiere in 2023.\r\n\r\nAttack on Titan has become a critical and commercial success. As of December 2019, the manga has over 100 million tankōbon copies in print worldwide, making it one of the best-selling manga series of all time. It has won several awards, including the Kodansha Manga Award, the Attilio Micheluzzi Award, and the Harvey Award.", "rating": 27, "dateCreation": "2022-08-28T12:30:14.407", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 10, "fields": {"title": "Netflix Releases Fullmetal Alchemist", "text": "Netflix is listing Fullmetal Alchemist The Final Alchemy (Hagane no Renkinjutsushi: Kanketsu-hen - Saigo no Rensei), the second of the two live-action sequel films in the Fullmetal Alchemist franchise, for release in India on September 24.\r\n\r\nThe two sequel Fullmetal Alchemist films feature a returning cast from the first live-action movie. The films star Ryōsuke Yamada (Hey! Say! JUMP member and live-action Assassination Classroom's Nagisa) as Edward Elric, Atomu Mizuishi (Garo - Makai no Hana, Prince of Tennis 2nd season musicals) as Alphonse Elric (voice and motion capture), Tsubasa Honda (live-action Blue Spring Ride's Futaba) as Winry Rockbell, and Dean Fujioka (live-action Happy Marriage!?) as Roy Mustang.", "rating": 12, "dateCreation": "2022-08-28T12:33:19.722", "categoryType": "NW", "postAuthor": 3}}, {"model": "news.post", "pk": 11, "fields": {"title": "One Piece Film Red Becomes 2022's Fastest Film to Top 10 Billion Yen", "text": "The official website for the One Piece Film Red anime announced on Friday that the movie has earned over 10 billion yen (about US$73 million) as of Thursday, its 20th day in theaters. It is the fastest film to reach this milestone in Japan this year.", "rating": 12, "dateCreation": "2022-08-28T12:34:01.839", "categoryType": "NW", "postAuthor": 3}}, {"model": "news.post", "pk": 12, "fields": {"title": "Death Note", "text": "Death Note (stylized in all caps) is a Japanese manga series written by Tsugumi Ohba and illustrated by Takeshi Obata. The story follows Light Yagami, a teen genius who discovers a mysterious notebook: the \"Death Note\", which belonged to the shinigami Ryuk, and grants the user the supernatural ability to kill anyone whose name is written in its pages. The series centers around Light's subsequent attempts to use the Death Note to carry out a worldwide massacre of individuals whom he deems immoral and to create a crime-free society, using the alias of a god-like vigilante named \"Kira\", and the subsequent efforts of an elite Japanese police task force, led by enigmatic detective L, to apprehend him. Death Note ran in Shueisha's manga magazine Weekly Shōnen Jump from December 2003 to May 2006. Its 108 chapters were collected in 12 tankōbon volumes.\r\n\r\nA 37-episode anime television series adaptation, produced by Madhouse and directed by Tetsurō Araki, was broadcast in Japan on Nippon Television from October 2006 to June 2007. A light novel based on the series, written by Nisio Isin, was also released in 2006. Additionally, various video games have been published by Konami for the Nintendo DS. The series was adapted into three live action films released in Japan in June 2006, November 2006, and February 2008, and a television drama in 2015. A miniseries titled Death Note: New Generation and a fourth film were released in 2016. An American film adaptation was released exclusively on Netflix in August 2017 and a sequel is reportedly in the works.\r\n\r\nDeath Note media, except for video games and soundtracks, is licensed and released in North America by Viz Media. The episodes from the anime first appeared in North America as downloadable from IGN before Viz Media licensed it. The series was aired on YTV's Bionix anime block in Canada and on Adult Swim in the United States with a DVD release following. The live-action films briefly played in certain North American theaters, in 2008, before receiving home video releases. As of April 2015, the Death Note manga had over 30 million copies in circulation.", "rating": 22, "dateCreation": "2022-08-28T12:35:18.553", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 13, "fields": {"title": "Greta Van Fleet", "text": "Greta Van Fleet is an American rock band from Frankenmuth, Michigan, formed in 2012. It consists of Kiszka brothers Josh (vocals), Jake (guitar) and Sam (bass guitar, keyboards); and Danny Wagner (drums). They were signed to Lava Records in March 2017,[2] and a month later they released their debut studio EP, Black Smoke Rising. Their debut single, \"Highway Tune\", topped the Billboard U.S. Mainstream Rock and Active Rock charts in September 2017 for four weeks in a row.[3] Their second EP, From the Fires, containing the four songs from Black Smoke Rising and four new songs, was released on November 10, 2017, alongside a second single, \"Safari Song\". From the Fires went on to win the 2019 Grammy Award for Best Rock Album.[4]\r\n\r\nTheir debut full-length studio album, Anthem of the Peaceful Army, was released on October 19, 2018, and topped the Billboard Rock Album charts in the first week after its release. The album's first single, \"When the Curtain Falls\", was released ahead of it in July 2018 and became the band's third number-one single on the U.S. Billboard Mainstream Rock charts.[5][6][7] Anthem of the Peaceful Army also debuted atop the Billboard Hard Rock charts and reached the number one spot on the Billboard Top Album Sales charts in the first week after its release.[8][9] A second studio album, The Battle at Garden's Gate was released on April 16, 2021.", "rating": 19, "dateCreation": "2022-08-28T12:36:16.881", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 14, "fields": {"title": "Rammstein", "text": "Rammstein (German pronunciation: [ˈʁamʃtaɪn], lit. \"ramming stone\") is a German Neue Deutsche Härte band formed in Berlin in 1994. The band's lineup—consisting of lead vocalist Till Lindemann, lead guitarist Richard Kruspe, rhythm guitarist Paul Landers, bassist Oliver Riedel, drummer Christoph Schneider, and keyboardist Christian \"Flake\" Lorenz—has remained unchanged throughout their history, along with their approach to songwriting, which consists of Lindemann writing and singing the lyrics over instrumental pieces the rest of the band have completed beforehand. Prior to their formation, some members were associated with the punk rock acts Feeling B and First Arsch.\r\n\r\nAfter winning a local contest, Rammstein were able to record demos and send them to different record labels, eventually signing with Motor Music. Working with producer Jacob Hellner, they released their debut album Herzeleid in 1995. Though the album initially sold poorly, the band gained popularity through their live performances and the album eventually reached No. 6 in Germany. Their second album, Sehnsucht, was released in 1997 and debuted at No. 1 in Germany, resulting in a worldwide tour lasting nearly four years and spawning the successful singles \"Engel\" and \"Du hast\" and the live album Live aus Berlin (1999). Following the tour, Rammstein signed with major label Universal Music and released Mutter in 2001. Six singles were released from the album, all charting in countries throughout Europe. The lead single, \"Sonne\", reached No. 2 in Germany. Rammstein released Reise, Reise in 2004 and had two more singles reach No. 2 in Germany: \"Mein Teil\" and \"Amerika\"; the former song reached No. 1 in Spain, becoming their first No. 1 single.\r\n\r\nTheir fifth album, Rosenrot, was released in 2005, and the lead single, \"Benzin\", reached No. 6 in Germany. Their second live album, Völkerball, was released in 2006. The band released their sixth album, Liebe ist für alle da, in 2009, with its lead single, \"Pussy\", becoming their first No. 1 hit in Germany despite having a controversial music video that featured hardcore pornography. The band then entered a recording hiatus and toured for several years, releasing the Made in Germany greatest hits album as well as the Rammstein in Amerika and Paris live albums. After a decade without new music, Rammstein returned in 2019 with the song \"Deutschland\", which became their second No. 1 hit in Germany. Their untitled seventh studio album was released in May 2019 and reached No. 1 in 14 countries. While sheltering during COVID-19 lockdowns, the band spontaneously wrote and recorded their eighth studio album, Zeit, which was released in April 2022.\r\n\r\nRammstein were one of the first bands to emerge within the Neue Deutsche Härte genre, with their debut album leading the music press to coin the term, and their style of music has generally had a positive reception from music critics. Commercially, the band have been very successful, earning many No. 1 albums as well as gold and platinum certifications in countries around the world. Their grand live performances, which often feature pyrotechnics, have contributed to their popularity growth. Despite success, the band have been subject to some controversies, with their overall image having been criticized; for instance, the song \"Ich tu dir weh\" forced its parent album Liebe ist für alle da to be re-released in Germany with the song removed due to its sexually explicit lyrics.", "rating": 21, "dateCreation": "2022-08-28T12:36:50.381", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 16, "fields": {"title": "Hogwarts Legacy release date and platforms", "text": "After Warner Bros. Games revealed that it's due to launch in \"Holiday 2022\", news confirmed Hogwarts Legacy has been delayed and will be now be releasing February 10, 2023. \r\n\r\nThe game was originally set to launch in 2021, but was then delayed into April 2022 before being pushed back to a holiday window and then ultimately into 2023. It will launch in February on Xbox Series X, Xbox One, PS5, PS4, PC. While Hogwarts Legacy is also set to release on Switch, it's expected to arrive at a later date, with news of a launch date said to be coming \"soon.\"", "rating": 0, "dateCreation": "2022-08-28T15:49:48.938", "categoryType": "NW", "postAuthor": 3}}, {"model": "news.post", "pk": 17, "fields": {"title": "Steins;Gate", "text": "Steins;Gate is a 2009 science fiction visual novel game developed by 5pb. and Nitroplus. It is the second game in the Science Adventure series, following Chaos;Head. The story follows a group of students as they discover and develop technology that gives them the means to change the past. The gameplay in Steins;Gate includes branching scenarios with courses of interaction.\r\n\r\nSteins;Gate was released for the Xbox 360 on October 15, 2009. The game was ported to Windows on August 26, 2010, PlayStation Portable on June 23, 2011, iOS on August 25, 2011, PlayStation 3 on May 24, 2012, PlayStation Vita on March 14, 2013, and Android on June 27, 2013. The game is described by the development team as a \"hypothetical science ADV\" (想定科学ADV, Sōtei Kagaku ADV).[1] JAST USA released the PC version in North America on March 31, 2014, both digitally and as a physical collector's edition, while PQube released the PS3 and Vita versions in North America and Europe in 2015.[2] Additionally, the iOS version was released in English on September 9, 2016.[3]\r\n\r\nA manga adaptation of the game, created by Yomi Sarachi, was serialized from 2009 to 2013, and later published in North America from 2015 to 2016. A second manga series, illustrated by Kenji Mizuta, began serialization in Mag Garden's Monthly Comic Blade on December 28, 2009. An anime adaptation by White Fox aired in Japan between April 6, 2011, and September 14, 2011, and has been licensed in North America by Funimation. An animated film premiered in Japanese theaters on April 20, 2013.[4][5] A fan disc of the game, titled Steins;Gate: My Darling's Embrace, was released on June 16, 2011.\r\n\r\nA non-canon 8-bit sequel to the game, titled Steins;Gate: Hen'i Kuukan no Octet or Steins;Gate 8bit, was released on October 28, 2011.[6] Another game, Steins;Gate: Linear Bounded Phenogram, was released on April 25, 2013.[7] A follow-up game, Steins;Gate 0, was released on December 10, 2015, for PS3, PlayStation 4 and Vita,[8] and received an anime adaptation in 2018.[9] A remake of the original visual novel titled Steins;Gate Elite which presents fully animated cutscenes from the Steins;Gate anime was released for PlayStation 4, PlayStation Vita, Nintendo Switch and Steam in 2019. Included as a bonus for the Nintendo Switch version, an entirely new game called 8-bit ADV Steins;Gate[a] in the style of Famicom adventure games from the 1980s, was released. A thematic sequel, tentatively titled Steins;???, is in development.", "rating": 0, "dateCreation": "2022-08-28T20:23:59.384", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 18, "fields": {"title": "Elfen Lied", "text": "Elfen Lied (Japanese: エルフェンリート, Hepburn: Erufen Rīto) is a Japanese manga series written and illustrated by Lynn Okamoto. It was originally serialized in Shueisha's Weekly Young Jump from June 2002 to August 2005, with the 107 chapters collected into twelve tankōbon volumes. Elfen Lied revolves around the interactions, views, emotions, and differences between human beings and the Diclonii, a mutant species similar to humans in build but distinguishable by two horns on their heads and \"vectors\", transparent telekinetically controlled arms that have the power to manipulate and cut objects within their reach. The series is centered on the teenage Diclonius girl \"Lucy\" who was rejected by human beings and subsequently wants revenge.\r\n\r\nThe series' title is German for \"Elves' Song\" or more formally \"song of the elves'\" and takes its name from the song \"Elfenlied\", which is featured in the story. Elfen Lied involves themes of discrimination, social alienation, identity, prejudice, revenge, abuse, jealousy, regret, and the value of humanity. It is also noted for the graphic violence, emotional themes of how the characters change through, and the overall transgressive subject matter of the whole story.\r\n\r\nA 13-episode anime television series adaptation was produced by the studio Arms and broadcast on AT-X from July to October 2004. The anime finished airing before the manga was complete; as a result, the plot differed between the two, especially the ending. The manga is licensed in North America by Dark Horse Comics. The anime series has been licensed in North America by ADV Films and in Australia by Madman Entertainment.", "rating": 0, "dateCreation": "2022-08-28T20:26:57.537", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 19, "fields": {"title": "Drifters", "text": "Drifters (Japanese: ドリフターズ, Hepburn: Dorifutāzu) is a Japanese manga series written and illustrated by Kouta Hirano. The manga started serialization in Shōnen Gahosha's magazine Young King Ours in April 2009. It focuses on various historical figures summoned to an unknown world where their skills and techniques are needed by magicians in order to save their world from total destruction. An anime television series adaptation aired between October and December 2016; three additional original video animation (OVA) episodes were released from December 2017 to November 2018.", "rating": 0, "dateCreation": "2022-08-28T20:27:00.852", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 21, "fields": {"title": "One-Punch Man", "text": "One-Punch Man (Japanese: ワンパンマン, Hepburn: Wanpanman) is a Japanese superhero manga series created by One. It tells the story of Saitama, a superhero who, because he can defeat any opponent with a single punch, grows bored from a lack of challenge. One wrote the original webcomic manga version in early 2009.\r\n\r\nA digital manga remake began publication on Shueisha's Tonari no Young Jump website in June 2012. Written by One and illustrated by Yusuke Murata, its chapters are periodically compiled and published into individual tankōbon volumes. As of June 2022, 26 volumes have been released. In North America, Viz Media has licensed the remake manga for English language release and has serialized it in its Weekly Shonen Jump digital magazine.\r\n\r\nAn anime adaptation produced by Madhouse was broadcast in Japan from October to December 2015. A second season, produced by J.C.Staff, was broadcast from April to July 2019. A third season has been announced. Licensed in North America by Viz Media, it premiered in the United States on Adult Swim's Toonami programming block in July 2016. The second season premiered in October 2019.\r\n\r\nAs of June 2012, the original webcomic manga surpassed 7.9 million hits. As of April 2020, the manga remake had sold over 30 million copies worldwide, making it one of the best-selling manga series.", "rating": 33, "dateCreation": "2022-08-28T20:31:50.564", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 22, "fields": {"title": "Elden Ring dataminer explains why enemies smack you when you reach for a potion", "text": "As reported by our friends at GamesRadar (opens in new tab), prolific Souls series dataminer Zullie the Witch (opens in new tab) has released a new video touching on a slightly controversial aspect of Elden Ring's much-discussed difficulty: enemies' propensity for reacting to certain actions (like self-healing) almost as fast as you can perform them, sometimes referred to by fans as \"input reading.\"\r\n\r\nHas this ever happened to you? You've whittled down the Godskin Guy's health to within bare millimeters of victory, as he has done to you. Thankfully, you've got an ace in the hole: the healing Flask of Crimson Tears. One little chug and you'll have some breathing room in these final moments of the battle. But as soon as you pull the flask from your belt the Godskin Guy is already charging up his little blackflame hadouken.\r\n\r\nAlready committed to the drinking animation, you can only watch as that fireball smacks you in the face before your health can fully restore. You die, everything is ruined, your marriage is in shambles, Rome has fallen, game over.\r\n\r\nBut how does this happen? \"Input reading\" almost implies the AI is tracking your keystrokes, but Zullie's findings show that enemy AI is keyed to watch for the in-game animation of your moves. It's less that the Godskin Guy instantaneously reacts to you pressing \"X,\" and more that he instantaneously reacts to player usage of certain items⁠—a key distinction when there are more obscure healing methods that the Godskin Guys will not punish. \r\n\r\nEnemy AI will use a similar function to detect and dodge projectile spells. Zullie demonstrates this last point by showing a boss dodging even when she aims her spells away from it.\r\n\r\nIn her video, Zullie says she empathizes with some players feeling that this is still \"unfair or artificial\" difficulty, but you know what? I don't! I think it's awesome. FromSoftware's games have adapted to how people play them over time. Gamers hid behind their shields too much in Dark Souls, so Bloodborne removed shields and prioritized dodging. Noticing some players spamming their dodge and ignoring parries and positioning, FromSoft switched to a parry-dominant combat system in Sekiro, nerfing the invincibility frames of that game's dodge move.\r\n\r\nElden Ring has notoriously tripped players up with its tricky dodge timing on attacks: bosses like Margit or the Crucible Knights follow interminably long wind-ups with quick attack delivery, punishing early, sloppy dodging. I see the heal punishes as an extension of this design.\r\n\r\nIn previous FromSoft games (and with many enemies in Elden Ring) it's a simple enough matter to create some space between you and an enemy and heal up. Punishing that behavior keeps you on your toes and introduces difficulty in a clever, lateral fashion, one you can consciously adjust to. It's possible to time your heals to avoid a Godskin Guy's punish, but then it's also possible to practice not getting hit so many times.\r\n\r\nSo I'm glad the Godskin Guys will cheekily interrupt my healing with their obnoxious little flame blasts. They will come up and slap my drink out of my hand every time I go for a sip, and I will say \"thank you\" when they do it. I will improvise, adapt, and overcome, developing as a person and as an enlightened gamer.", "rating": 0, "dateCreation": "2022-08-28T20:38:56.379", "categoryType": "NW", "postAuthor": 2}}, {"model": "news.post", "pk": 23, "fields": {"title": "Creative Assembly teases a new third-person 'action project'", "text": "Creative Assembly, who you'll mostly know for the impossible breadth and depth of its library of strategy games, has announced that it's working on a new project to \"sit alongside Total War, Hyenas and the studio’s other yet-to-be announced project\". What's more, it's specifically looking for help from developers \"with experience working on third-person titles using the Unreal 5 engine\".\r\n\r\nThe new project was announced in a post released earlier today on the Creative Assembly website (opens in new tab). It's all pretty mysterious, though. Aside from saying that a new project is underway and implying that it's going to be a third-person title, the studio says it'll be keeping shtum about further details for a while yet.\r\n\r\nIn a bid to reassure strategy fans that might worry about one of the genre's most stalwart devs branching out, the announcement concludes with a statement that Creative Assembly's Sofia studio will continue to maintain a team dedicated to working on future Total War projects.\r\n\r\nPersonally, I'm more excited about the prospect of Creative Assembly getting experimental than I am for yet another Total War entry. I'm a sucker for grand strategy, but for whatever reason the more military-focused games they put out have never grabbed me quite as firmly as the expansive diplomatic and political simulations that you get from Paradox. On the other hand, Alien: Isolation (opens in new tab) was one of my favourite experiences of the last ten years. Here's hoping that the studio can pull off that trick again with whatever this third-person title turns out to be.\r\n\r\nThis new project isn't the only non-strategy product that Creative Assembly has in the pipeline. It's currently accepting signups for the alpha of Hyenas (opens in new tab), a new multiplayer shooter that promises zero-G battles, fast-paced battles, and… \"epic merch\"? Sure, okay. I might just wait and see what this other project is, if I'm honest.", "rating": 0, "dateCreation": "2022-08-28T20:41:06.830", "categoryType": "NW", "postAuthor": 1}}, {"model": "news.post", "pk": 24, "fields": {"title": "Led Zeppelin", "text": "Led Zeppelin were an English rock band formed in London in 1968. The group consisted of vocalist Robert Plant, guitarist Jimmy Page, bassist/keyboardist John Paul Jones, and drummer John Bonham. With a heavy, guitar-driven sound, they are cited as one of the progenitors of hard rock and heavy metal, although their style drew from a variety of influences, including blues and folk music. Led Zeppelin have been credited as significantly impacting the nature of the music industry, particularly in the development of album-oriented rock (AOR) and stadium rock.\r\n\r\nOriginally named the New Yardbirds, Led Zeppelin signed a deal with Atlantic Records that gave them considerable artistic freedom. Initially unpopular with critics, they achieved significant commercial success with eight studio albums over ten years. Their 1969 debut, Led Zeppelin, was a top-ten album in several countries and featured such tracks as \"Good Times Bad Times\", \"Dazed and Confused\" and \"Communication Breakdown\". Led Zeppelin II (1969) was their first number-one album, and yielded \"Ramble On\" and \"Whole Lotta Love\". In 1970, they released Led Zeppelin III which featured \"Immigrant Song\". Their untitled fourth album, commonly known as Led Zeppelin IV (1971), is one of the best-selling albums in history with 37 million copies sold. The album includes \"Black Dog\", \"Rock and Roll\" and \"Stairway to Heaven\", with the latter being among the most popular and influential works in rock history. Houses of the Holy (1973) yielded \"The Ocean\", \"Over the Hills and Far Away\" and \"The Rain Song\". Physical Graffiti (1975), a double album, featured \"Trampled Under Foot\" and \"Kashmir\".\r\n\r\nPage wrote most of Led Zeppelin's music, particularly early in their career, while Plant wrote most of the lyrics. Jones's keyboard-based compositions later became central to their music, which featured increasing experimentation. The latter half of their career saw a series of record-breaking tours that earned the group a reputation for excess and debauchery. Although they remained commercially and critically successful, their touring and output, which included Presence (1976) and In Through the Out Door (1979), grew limited, and the group disbanded following Bonham's death in 1980. Since then, the surviving former members have sporadically collaborated and participated in one-off reunions. The most successful of these was the 2007 Ahmet Ertegun Tribute Concert in London, with Bonham's son Jason Bonham on drums.\r\n\r\nLed Zeppelin are one of the best-selling music artists of all time; their total record sales are estimated to be between 200 to 300 million units worldwide. They achieved eight consecutive UK number-one albums and six number-one albums on the US Billboard 200, with five of their albums certified Diamond in the US. Rolling Stone magazine described them as \"the heaviest band of all time\", \"the biggest band of the Seventies\", and \"unquestionably one of the most enduring bands in rock history\". They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were \"as influential\" during the 1970s as the Beatles were during the 1960s.[1]", "rating": 0, "dateCreation": "2022-08-28T21:08:00.277", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 25, "fields": {"title": "Dark Souls 2", "text": "Dark Souls II[a] is a 2014 action role-playing game developed by FromSoftware and published by Bandai Namco Games. An entry in the Dark Souls series, it was released for Windows, PlayStation 3, and Xbox 360. Taking place in the kingdom of Drangleic, the game features both player versus environment (PvE) and player versus player (PvP) gameplay. Dark Souls II was released in March 2014 after some initial delays, with the Windows version being released the following month.\r\n\r\nDark Souls II was a critical and commercial success. A remastered version of the game, titled Dark Souls II: Scholar of the First Sin, was released for PlayStation 3, PlayStation 4, Xbox 360, Xbox One, and Windows in April 2015. It contains the original game and its downloadable content with upgraded graphics, expanded online multiplayer capacity, and various other changes. A sequel, Dark Souls III, was released in 2016.", "rating": 0, "dateCreation": "2022-09-06T18:12:39.826", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 26, "fields": {"title": "Dark Souls 3", "text": "Dark Souls III[a] is a 2016 action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment for PlayStation 4, Xbox One, and Windows. An entry in the Dark Souls series, it is played in a third-person perspective, and players have access to various weapons, armour, magic, and consumables that they can use to fight their enemies. Hidetaka Miyazaki, the creator of the series, returned to direct the game after handing the development duties of Dark Souls II to others.\r\n\r\nDark Souls III was critically and commercially successful, with critics calling it a worthy and fitting conclusion to the series. It shipped over three million copies within its first two months and over 10 million by 2020. Two downloadable content (DLC) expansions, Ashes of Ariandel and The Ringed City, were also made. A complete version containing the base game and both expansions, Dark Souls III: The Fire Fades Edition, was released in April 2017.", "rating": 0, "dateCreation": "2022-09-06T18:30:26.521", "categoryType": "AR", "postAuthor": 2}}, {"model": "news.post", "pk": 27, "fields": {"title": "Nightwish", "text": "Nightwish is a Finnish symphonic metal band from Kitee. The band was formed in 1996 by lead songwriter and keyboardist Tuomas Holopainen, guitarist Emppu Vuorinen, and former lead singer Tarja Turunen.[1] The band soon picked up drummer Jukka Nevalainen, and then bassist Sami Vänskä after the release of their debut album, Angels Fall First (1997). In 2001, Vänskä was replaced by Marko Hietala, who also took over the male vocalist role previously filled by Holopainen or guest singers.\r\n\r\nAlthough Nightwish have been prominent in their home country since Angels Fall First, they did not achieve wider success until the release of the albums Oceanborn (1998), Wishmaster (2000) and Century Child (2002). Their 2004 album, Once, has sold more than one million copies[2] and was the band's breakthrough in the United States. Their biggest US hit single, \"Wish I Had an Angel\" (2004), received MTV airplay and was included on three US film soundtracks to promote their North American tour.[3][4] The band produced three more singles and two music videos for Once, as well as a re-recording of \"Sleeping Sun\" for the compilation album, Highest Hopes: The Best of Nightwish (2005), before Turunen's dismissal in October 2005.[3] Her last performance with Nightwish was during a concert recorded for the live album/DVD End of an Era. After the concert, the other members informed Turunen with an open letter that she was no longer a member of Nightwish.\r\n\r\nIn May 2007, Nightwish announced Anette Olzon as Turunen's replacement.[5] That September, the band released their sixth album, Dark Passion Play, which has sold almost 2 million copies. The album's lead single, \"Amaranth\", became one of Nightwish's most successful in Europe.[6] The supporting tour, one of the band's largest, started on October 6, 2007, and ended on September 19, 2009.[7][8] The band released an EP/live album, Made in Hong Kong (And in Various Other Places), in March 2009 as a CD/DVD, and their seventh studio album, Imaginaerum, was released globally on various days in late 2011/early 2012.[2][9]\r\n\r\nOn October 1, 2012, Nightwish announced that they had parted ways with Olzon and would be finishing the tour with at that time ReVamp vocalist (ex-After Forever) Floor Jansen.[10][non-primary source needed][11] In October 2013, Nightwish made Jansen and longtime session uilleann pipes player Troy Donockley permanent members of the band, and they were featured in the acclaimed album Endless Forms Most Beautiful, released on March 27, 2015. From 2014 to 2019, Nevalainen, while still a member of the band, was inactive due to severe insomnia issues; in July 2019, he announced that he would not be returning to the band, with Kai Hahto, who had acted as his replacement since 2014 (including by performing all drums on Endless Forms Most Beautiful), being promoted as the official drummer, and is featured as such at the ninth album, Human. :II: Nature., which was released internationally on April 10, 2020. After twenty years of performing with the band, it was announced that bassist Marko Hietala had parted ways with the band in January 2021. Jukka Koskinen was announced as Hietala's replacement to play bass during the tour. In August 2022, he was announced as a permanent member of the band.\r\n\r\nNightwish is the third-best-selling band and musical entity in Finland with certified sales of nearly 900,000 certified copies.[12][13][14][15][16] The group is also the most successful Finnish band worldwide, selling more than 10 million records[17] and receiving more than 60 gold and platinum awards, having released six Number 1 albums and thirteen Number 1 singles.[18] On October 26, 2018, Nightwish was inducted into the Finnish Music Hall of Fame, becoming the honorary gallery's 11th member.[19]", "rating": 0, "dateCreation": "2022-09-06T18:36:27.205", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 28, "fields": {"title": "Within Temptation", "text": "Within Temptation is a Dutch symphonic metal band founded in April 1996 by vocalist Sharon den Adel and guitarist Robert Westerholt.[3] They have been classified by critics as gothic metal and symphonic metal, although each album contains other influences outside these genres. Their most prominent and well-known sound is described as symphonic metal,[4] although their earlier material, such as debut album Enter, was mostly gothic metal,[4][5][6][7] with Enter also having a hint of doom metal. In an interview, den Adel said they fell into a symphonic rock genre with various influences.[8] In another interview, den Adel stated that \"We consider ourselves more an atmospheric melodic symphonic metal/rock band... In my opinion, we are not a gothic band but we have gothic elements\".[9][10]\r\n\r\nAfter the release of their debut album Enter in 1997, the band became prominent in the Dutch underground scene. It was not until 2001 that they became known to the general public, with the single \"Ice Queen\" from their second album Mother Earth, which reached No. 2 on the Dutch charts.[3] This was followed by the band winning the Conamus Exportprijs,[11] a Dutch music award, four years in a row, and a fifth in 2016. Their next albums The Silent Force (2004) and The Heart of Everything (2007) debuted at No. 1 on the Dutch charts. In 2008, they released Black Symphony, a live album recorded with the Metropole Orchestra. This was followed in 2009 by An Acoustic Night at the Theatre, another live album, this time with acoustic renditions of the songs.\r\n\r\nThe band's fifth studio album, The Unforgiving, was released in March 2011 and was one part of a transmedia effort, alongside both a comic book series and a series of short films that together encompass a story. The album saw the band increasingly venturing on new musical territories outside symphonic metal. Their sixth studio album, Hydra, was released in early 2014 in Japan, Europe, and the United States. The album advanced the band's exploration of new musical genres and features guest appearances from various artists: Finnish singer Tarja Turunen, who appears in the lead single \"Paradise (What About Us?)\"; Howard Jones, former vocalist of American metalcore band Killswitch Engage; Dave Pirner, lead vocalist of American alternative rock band Soul Asylum; and American rapper Xzibit. The band had extensive airplay on BBC Radio 2 in the United Kingdom with one of the songs from the album, \"Whole World Is Watching\" featuring Pirner.\r\n\r\nTheir latest studio album, Resist, was released in February 2019 and incorporates influences from other musical styles such as industrial and EDM. By 2016, the band had already sold more than 3.5 million albums worldwide.", "rating": 0, "dateCreation": "2022-09-11T20:12:32.472", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 29, "fields": {"title": "Deathstars", "text": "Deathstars is a Swedish industrial metal band from Strömstad. Formed in 2000, the group are noted for their dark horror-themed lyrics, pessimistic and misanthropic social commentary, distinctive trademark face paint, dark stage uniforms and physical appearances that correspond to gothic fashion. They have released four full-length studio albums; Synthetic Generation (2002 in Europe and 2003 in North and South America), Termination Bliss (2006), Night Electric Night (2009), and The Perfect Cult (2014). Deathstars have supported live acts by bands such as Korn and Cradle of Filth, the latter of which were part of the inspiration for Deathstars. Deathstars also supported Rammstein on their Made In Germany 1995–2011 tour.\r\n\r\nThe current lineup of the band consists primarily of members from Swordmaster, a black metal project that has former members of Dissection, and Ophthalamia. The band currently consists of lead guitarist Nightmare Industries, lead vocalist Whiplasher Bernadotte, bassist Skinny Disco, rhythm guitarist Cat Casino and drummer Nitro. The band normally uses standard C tuning, in which instruments are transposed two whole tones lower than standard tuning.", "rating": 0, "dateCreation": "2022-09-12T09:25:53.842", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 30, "fields": {"title": "Zeromancer", "text": "Zeromancer is a Norwegian industrial rock band formed in 1999 by members of the band Seigmen. The current lineup is Alex Møklebust (vocals), Kim Ljung (bass guitar/backup vocals), Noralf Ronthi (drums), Lorry Kristiansen (programming) and Per-Olav Wiik (lead guitar). They have released seven studio albums; the latest, Orchestra of Knives, was released in 2021.", "rating": 0, "dateCreation": "2022-09-12T09:36:56.211", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 31, "fields": {"title": "Hiroyuki Sawano", "text": "Hiroyuki Sawano (澤野 弘之, Sawano Hiroyuki, born September 12, 1980)[1] is a Japanese composer, arranger, lyricist, pianist, and Music Producer best known for his work on many anime series, video games, television dramas, and movies. His works include the musical scores for Attack on Titan, The Seven Deadly Sins, Blue Exorcist, Guilty Crown, Kill la Kill, Seraph of the End, and Mobile Suit Gundam Unicorn.[2] In addition to his role on the soundtrack, he also composes opening and ending theme songs for several series.[3] Overall, he has already provided the music for over 100 visual media works.[4]\r\n\r\nSawano was nominated for the Newtype Anime Awards 11 times, winning 4 of the nominations.[5] He has also won the Tokyo Anime Award three times,[5][6] as well as two recent prizes at the Anime Trending Awards.[7] He was represented by Legendoor between 2006 and 2017, and is currently represented by VV-ALKLINE.[8] In 2014, he started a vocal project under the name ''SawanoHiroyuki[nZk]''", "rating": 0, "dateCreation": "2022-09-12T17:41:04.645", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 32, "fields": {"title": "Lacrimosa", "text": "Lacrimosa is a gothic duo led by German Tilo Wolff, the main composer, and Finn Anne Nurmi. They are currently based in Switzerland, but originally from Germany. Originally counted among the bands of the Neue Deutsche Todeskunst genre, Lacrimosa have developed their style more towards powerful metal, but gothic elements still remain.[1]\r\n\r\nTheir current musical style mixes gothic rock and heavy metal, along with violin, trumpet, and more classical instruments, although their musical development throughout the years has also led to changes in instrumentation. Lacrimosa's lyrics are written almost exclusively in German, although since the 1995 album Inferno every album has featured one or two songs in English, generally written by Anne Nurmi. Finnish has also appeared in the spoken intro to two songs (\"Schakal\" on Inferno and \"The Turning Point\" on Elodia) and on a bonus track in a limited edition release of Fassade called Vankina. Their lyrics are mainly about loneliness, sadness, darkness, despair, and love.\r\n\r\nThe band has sold more than 20,000 copies of each album in Germany, but has also gained a large fanbase in Russia, Mexico and China.", "rating": 0, "dateCreation": "2022-09-14T10:53:21.935", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 33, "fields": {"title": "Harry Styles", "text": "Harry Edward Styles (born 1 February 1994) is an English singer, songwriter, and actor. His musical career began in 2010 as a solo contestant on the British music competition series The X Factor. Following his elimination, he was brought back to join the boy band One Direction, which went on to become one of the best-selling boy groups of all time before going on an indefinite hiatus in 2016.\r\n\r\nStyles released his self-titled debut solo album through Columbia Records in 2017. It debuted at number one in the UK and the US and was one of the world's top-ten best-selling albums of the year, while its lead single, \"Sign of the Times\", topped the UK Singles Chart. Styles' second album, Fine Line (2019), debuted atop the US Billboard 200 with the biggest ever first-week sales by an English male artist, and was the most recent album to be included in Rolling Stone's \"500 Greatest Albums of All Time\" in 2020. Its fourth single, \"Watermelon Sugar\", topped the US Billboard Hot 100. Featuring the chart-topping single \"As It Was\", Styles' third album, Harry's House (2022), was widely acclaimed and broke several records.\r\n\r\nStyles has received various accolades, including two Brit Awards, a Grammy Award, an Ivor Novello Award, and an American Music Award. His film roles include Dunkirk (2017), Don't Worry Darling, and My Policeman (both 2022). Aside from music and acting, Styles is known for his flamboyant fashion. He is the first man to appear solo on the cover of Vogue.", "rating": 0, "dateCreation": "2022-09-14T11:04:36.433", "categoryType": "AR", "postAuthor": 3}}, {"model": "news.post", "pk": 34, "fields": {"title": "Thirty Seconds to Mars", "text": "Thirty Seconds to Mars (commonly stylized as 30 Seconds to Mars) is an American rock band from Los Angeles, California, formed in 1998. The band consists of brothers Jared Leto (lead vocals, guitar, bass, keyboards) and Shannon Leto (drums, percussion). During the course of its existence, it has undergone various line-up changes.\r\n\r\nThe band's debut album, 30 Seconds to Mars (2002), was produced by Bob Ezrin and released to positive reviews but only to limited commercial success. The band achieved worldwide fame with the release of its second album A Beautiful Lie (2005), which received multiple certifications all over the world. Its next release, This Is War (2009), showed a dramatic evolution in the band's musical style, as it incorporated experimental music as well as eclectic influences. The recording process of the album was marked by a legal dispute with record label EMI that eventually became the subject of the documentary film Artifact (2012). Thirty Seconds to Mars then moved to Universal Music and released the fourth album, Love, Lust, Faith and Dreams (2013), to critical and commercial success. It was followed by America (2018), which polarized critics upon release.\r\n\r\nAs of September 2014, the band had sold over 15 million albums worldwide.[1] Thirty Seconds to Mars has consistently enjoyed sold out tours and numerous headlining festival slots. The band is noted for its energetic live performances and for fusing elements from a wide variety of genres, through its use of philosophical and spiritual lyrics, concept albums, and experimental music.[2] Thirty Seconds to Mars has received several awards and accolades throughout its career, including a Guinness World Record, and has been included in the Kerrang! list of best artists of the 2000s.[3]\r\n\r\nOn August 27, 2022, Jared Leto announced the 20th anniversary of their debut album on Twitter", "rating": 0, "dateCreation": "2022-09-14T11:28:53.671", "categoryType": "AR", "postAuthor": 1}}, {"model": "news.post", "pk": 70, "fields": {"title": "Harry Potter and the Philosopher's Stone", "text": "Harry Potter and the Philosopher's Stone (released in the United States, India and the Philippines as Harry Potter and the Sorcerer's Stone) is a 2001 fantasy film directed by Chris Columbus and distributed by Warner Bros. Pictures, based on J. K. Rowling's 1997 novel of the same name. Produced by David Heyman and written by Steve Kloves, it is the first instalment of the Harry Potter film series. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. Its story follows Harry's first year at Hogwarts School of Witchcraft and Wizardry as he discovers that he is a famous wizard and begins his formal wizarding education.\r\n\r\nWarner Bros. bought the film rights to the book in 1999 for a reported £1 million ($1.65 million). Production began in the United Kingdom in 2000, with Chris Columbus being chosen to create the film from a short list of directors that included Steven Spielberg and Rob Reiner. Rowling insisted that the entire cast be British and Irish, with the three leads chosen in August 2000 following open casting calls. The film was shot at Leavesden Film Studios and historic buildings around the United Kingdom, from September 2000 to March 2001.\r\n\r\nThe film was released to cinemas in the United Kingdom and Ireland on 10 and 11 November 2001 for two days of previews. It opened on 16 November in the United States, Canada and Taiwan as well as officially in the United Kingdom and Ireland. It became a critical and commercial success, grossing $974 million at the box office worldwide during its initial run, and over $1 billion with subsequent re-releases. It became the highest-grossing film of 2001 and the second-highest-grossing film at the time. The film was nominated for many awards, including Academy Awards for Best Original Score, Best Art Direction and Best Costume Design. It was followed by seven sequels, beginning with Harry Potter and the Chamber of Secrets in 2002 and ending with Harry Potter and the Deathly Hallows – Part 2 in 2011.", "rating": 0, "dateCreation": "2022-09-17T13:06:51.651", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 71, "fields": {"title": "The Lord of the Rings: The Fellowship of the Ring", "text": "The Lord of the Rings: The Fellowship of the Ring is a 2001 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson, based on 1954's The Fellowship of the Ring, the first volume of the novel The Lord of the Rings by J. R. R. Tolkien. The film is the first installment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Billy Boyd, Dominic Monaghan, Orlando Bloom, Christopher Lee, Hugo Weaving, Sean Bean, Ian Holm, and Andy Serkis. Set in Middle-earth, the story tells of the Dark Lord Sauron, who seeks the One Ring, which contains part of his soul, to return to power. The Ring has found its way to the young hobbit Frodo Baggins. The fate of Middle-earth hangs in the balance as Frodo and eight companions (who form the Fellowship of the Ring) begin their journey to Mount Doom in the land of Mordor, the only place where the Ring can be destroyed.\r\n\r\nThe Fellowship of the Ring was cofinanced and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 10 December 2001 at the Odeon Leicester Square in London and was theatrically released worldwide on 19 December 2001. The film was acclaimed by critics and fans alike, who considered it to be a landmark in filmmaking and an achievement in the fantasy film genre. It received praise for its visual effects, performances, Jackson's direction, screenplay, musical score, and faithfulness to the source material. It grossed $880 million worldwide in its initial release, making it the second highest-grossing film of 2001 and the fifth highest-grossing film of all time at the time of its release.[5] Following subsequent reissues, it has as of 2021 grossed over $897 million.[4]\r\n\r\nLike its successors, The Fellowship of the Ring is widely recognized as one of the greatest and most influential films ever made. The film received numerous accolades; at the 74th Academy Awards, it was nominated for thirteen awards, including Best Picture, winning for Best Cinematography, Best Makeup, Best Original Score, and Best Visual Effects.\r\n\r\nIn 2007, the American Film Institute named it one of the 100 greatest American films in history, being both the most recent film and the only film released in the 21st century to make it to the list. In 2021, the film was selected for preservation in the United States National Film Registry by the Library of Congress for being \"culturally, historically, or aesthetically significant\".[6]\r\n\r\nThe film was followed by The Two Towers in 2002, and by The Return of the King in 2003.", "rating": 0, "dateCreation": "2022-09-17T16:50:18.748", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 72, "fields": {"title": "Bullet for My Valentine", "text": "Bullet for My Valentine, often abbreviated as BFMV, are a Welsh heavy metal band from Bridgend, formed in 1998. The band is currently composed of Matthew Tuck (lead vocals, rhythm guitar), Michael Paget (lead guitar, backing vocals), Jason Bowld (drums) and Jamie Mathias (bass guitar, backing vocals). Former members include Michael Thomas, Jason James and Nick Crandle; the latter were on bass. They were formed under the name Jeff Killed John and started their music career by covering songs by Metallica and Nirvana. Jeff Killed John recorded six songs which were not released; two of these tracks were reworked later in their career as Bullet for My Valentine. A change of style from that of Jeff Killed John led the band to change their name.[1] In 2002, the band secured a five-album deal with Sony BMG. The band has stated that their music is influenced by classic metal acts such as Metallica, Iron Maiden and Slayer. The band is part of the Cardiff music scene.\r\n\r\nBullet for My Valentine's debut album The Poison was released on 3 October 2005 in the United Kingdom and on 14 February 2006 in the United States to coincide with Valentine's Day, in a nod to the band's name. The album entered the U.S. Billboard 200 at number 128. It was certified gold by the Recording Industry Association of America. The band made appearances at the Download Festival and Kerrang! XXV, and undertook a U.S. tour with Rob Zombie. Bullet for My Valentine's second studio album, Scream Aim Fire, was released on 28 January 2008 and debuted at number four on the Billboard 200. The band's third album, Fever, was released on 26 April 2010 and debuted at number three on the Billboard 200. On 8 February 2013, the band released their fourth studio album, Temper Temper,[2] which peaked at number 13 on the Billboard 200. On 14 August 2015, the band released their fifth studio album, Venom, which peaked at number 8 on the Billboard 200. On 29 June 2018, the band released their sixth studio album, Gravity. Their self-titled seventh studio album was released on 5 November 2021. The band has sold over one million albums in the United States and over 3,000,000 albums worldwide[3] and are the most-successful act in the Kerrang! Awards category of Best British Band with three wins.", "rating": 0, "dateCreation": "2022-09-15T16:56:50.628", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 73, "fields": {"title": "Bring Me the Horizon", "text": "Bring Me the Horizon (often abbreviated as BMTH) are a British rock band formed in Sheffield in 2004. The group consists of lead vocalist Oliver Sykes, guitarist Lee Malia, bassist Matt Kean, drummer Matt Nicholls and keyboardist Jordan Fish. They are signed to RCA Records globally and Columbia Records exclusively in the United States.\r\n\r\nThe band released their debut album Count Your Blessings in 2006. Upon release, the album's deathcore sound polarised listeners, and was met with critical disdain. The band began to break away from this sound with Suicide Season (2008), which was a creative, critical and commercial turning point for the band. Bring Me the Horizon released their third album, There Is a Hell Believe Me I've Seen It. There Is a Heaven Let's Keep It a Secret., in 2010, propelling them to greater international fame, whilst incorporating influences from classical music, electronica and pop. Their major label debut, Sempiternal (2013) achieved Gold certification in Australia (35,000) and Silver in the United Kingdom (60,000). That's the Spirit (2015) debuted at number two in the UK Albums Chart and the US Billboard 200.[1][2] Their sixth studio album Amo (2019) became their first UK chart topper. The same year, the band also put out the commercial release, Music to Listen To... (2019). The following year, the band released Post Human: Survival Horror (2020), the first in a planned series of four projects under the Post Human name. The band have also released two extended plays and two live albums. They have received four Kerrang! Awards, including two for Best British Band and one for Best Live Band, and have been nominated for two Grammy Awards. The band has sold over 4 million records worldwide.[3]\r\n\r\nThe style of their early work, including their debut album Count Your Blessings, has been described primarily as deathcore, but over the course of several albums, the band has shifted its style and moved in a more melody-oriented direction by combining their approach to metalcore with elements of electronica, pop and hip hop.", "rating": 0, "dateCreation": "2022-09-28T17:53:41.336", "categoryType": "AR", "postAuthor": 6}}, {"model": "news.post", "pk": 75, "fields": {"title": "Limp Bizkit", "text": "Limp Bizkit is an American rap rock band from Jacksonville, Florida. Its lineup consists of lead vocalist Fred Durst, drummer John Otto, guitarist Wes Borland, turntablist DJ Lethal and bassist Sam Rivers. The band's music is marked by Durst's angry vocal delivery and Borland's sonic experimentation. Borland's elaborate visual appearance, which includes face and body paint, masks, and uniforms, also plays a large role in Limp Bizkit's live shows. The band has been nominated for three Grammy Awards, sold 40 million records worldwide, and won several other awards.[1] The band has released 26 singles, the most notable of which include \"Nookie\", \"Re-Arranged\", \"Break Stuff\", \"Take a Look Around\", \"Rollin' (Air Raid Vehicle)\", \"My Generation\", \"My Way\", \"Eat You Alive\", and their cover of The Who's 1971 single \"Behind Blue Eyes\", all of which have charted within the top 20 of the US Alternative Airplay Chart.[2]\r\n\r\nFormed in 1994,[3] Limp Bizkit became popular playing in the Jacksonville underground music scene in the late 1990s, and signed with Flip Records, a subsidiary of Interscope, which released the band's debut album, Three Dollar Bill, Y'all (1997). The band achieved mainstream success with its second and third studio albums, Significant Other (1999) and Chocolate Starfish and the Hot Dog Flavored Water (2000), although this success was marred by a series of controversies surrounding its performances at Woodstock '99 and the 2001 Big Day Out festival.\r\n\r\nBorland left the group in 2001, but Durst, Rivers, Otto, and Lethal continued to record and tour with guitarist Mike Smith. Following the release of its album Results May Vary (2003), Borland rejoined the band and recorded The Unquestionable Truth (Part 1) (2005) with Durst, Rivers, Lethal, and drummer Sammy Siegler before entering a hiatus. In 2009, the band reunited with Borland playing guitar and began touring, culminating with the recording of the album Gold Cobra (2011), after which it left Interscope and later signed with Cash Money Records; DJ Lethal quit the band soon afterward, returning in 2018. After years of teasing an album tentatively titled Stampede of the Disco Elephants,[4] the band released its sixth studio album Still Sucks on October 31, 2021.", "rating": 0, "dateCreation": "2022-09-30T11:14:47.518", "categoryType": "NW", "postAuthor": 6}}, {"model": "news.category", "pk": 9, "fields": {"name": "Gaming"}}, {"model": "news.category", "pk": 10, "fields": {"name": "Anime"}}, {"model": "news.category", "pk": 11, "fields": {"name": "Music"}}, {"model": "news.category", "pk": 12, "fields": {"name": "Movies"}}]